{
  "title": "System Design Interview Roadmap: 45 Problems To Master (With Architect-Level Guidance)",
  "slug": "system-design-45-problems-roadmap",
  "date": "2025-01-20",
  "author": "Satyam Parmar",
  "tags": [
    "Backend Engineering",
    "System Design",
    "Distributed Systems",
    "Interview Prep",
    "Architecture",
    "Roadmap"
  ],
  "excerpt": "Most developers fail system design interviews not for lack of talent, but for lack of a clear study path. Master these 45 problems, level by level, with what to design, what to discuss, and how to practice like a real architect.",
  "content": "# System Design Interview Roadmap\n\nYou do not need 500 random questions. You need the right 45 practiced the right way.\n\nThis roadmap is organized by difficulty with what to design, what interviewers look for, and how to practice. Use it as a study plan and a checklist.\n\n---\n\n## Easy Level 1 to 10\n\n1. Parking Garage\n- Design entry exit flows, ticketing, pricing, and availability counters per level.\n- Think rate limits at gates, simple relational schema, and backpressure at peaks.\n\n2. Vending Machine\n- Finite state machine for selection, payment, dispense, and refunds.\n- Handle out of stock, change return, and timeouts cleanly.\n\n3. Distributed Cache\n- Read write policies, TTL and eviction like LRU, and cache stampede control.\n- Decide consistency needs and fallbacks when cache misses happen.\n\n4. Authentication System\n- Login flow, sessions versus JWT, refresh tokens, and password storage.\n- Protect brute force and add device or IP based signals.\n\n5. Distributed Job Scheduler\n- Leader election, cron triggers, worker pool, retries, and idempotency.\n- Persist job state and move failures to a dead letter queue.\n\n6. Key Value Store for a Search Engine\n- Partition by hash with awareness of index shards; replicate for availability with quorum reads writes.\n- Optimize for write amplification and compaction; mitigate hot terms with caching and tiered storage.\n\n7. URL Shortener (Bit.ly or TinyURL)\n- Short id generation, cache heavy read path, and sub millisecond redirects at the edge.\n- Handle hot keys and abuse; add per link analytics and rate limiting.\n\n8. Content Delivery Network CDN\n- Edge caching, TTL and validation, and origin failover.\n- Optimize cache hit ratio and pre warm popular assets.\n\n9. Text Storage Pastebin\n- Store variable size text with metadata, retention, and abuse guards.\n- Optimize for read heavy access with cache and CDN.\n\n10. UPI like Payments simplified\n- Idempotency keys, double spend protection, and a ledger model.\n- Reconciliation jobs and clear failure handling for transfers.\n\n---\n\n## Medium Level 11 to 32\n\n11. Tinder\n- Recommendation pipeline with geo filters, rate limits, and anti abuse.\n- Store swipe events and build daily aggregates for freshness.\n\n12. Twitter Timeline and Search (or Facebook Feed and Search)\n- Choose fanout on write vs fan in on read; denormalize for home timeline and enable ranked retrieval.\n- Power search and trends with inverted indexes and streaming aggregation; apply abuse and spam controls.\n\n13. Reddit\n- Voting mechanics, ranking with decay, and community isolation.\n- Moderation tools and rate limits for spam.\n\n14. Netflix\n- Catalog service, CDN distribution, and adaptive bitrate streaming.\n- Recommendations pipeline and regional licensing constraints.\n\n15. Spotify\n- Playlists, offline cache sync, and real time playback state.\n- Search and recommendations with user taste profiles.\n\n16. TikTok\n- For you feed ranking, upload pipeline, and video processing.\n- Cost controls for storage and network egress.\n\n17. Shopify\n- Multi tenant stores, product inventory, checkout, and webhooks.\n- Isolation per merchant and spike handling on drops.\n\n18. YouTube\n- Upload to transcode to store to CDN pipeline with comments.\n- Thumbnails, rate limits, and copyright workflows.\n\n19. Social Network Data Structures (Facebook)\n- Model the social graph, adjacency lists, secondary indexes, and privacy scopes for reads.\n- Power feed ranking signals and notifications while keeping storage and queries efficient.\n\n20. WhatsApp\n- End to end messaging basics, delivery receipts, and presence.\n- Group fanout and media handling constraints.\n\n21. Instagram\n- Media storage, stories life cycle, and thumbnail generation.\n- Explore ranking and hashtag search.\n\n22. Rate Limiter\n- Token bucket or leaky bucket per key and global limits.\n- Placement at gateway and service level with burst control.\n\n23. Google Search simplified\n- Crawler to index to ranking with caches.\n- Query autosuggest and abuse defenses.\n\n24. Payment System\n- Double entry ledger, idempotency, reconciliation, and refunds.\n- Chargeback handling and audit trails.\n\n25. Personal Finance Aggregator (Mint.com)\n- Aggregation via aggregators or bank APIs; OAuth flows, data normalization, and categorization pipelines.\n- Budgeting insights, anomaly alerts, and encryption/privacy by design with regional compliance.\n\n26. Notification Service\n- Fanout across email sms push with templates and retries.\n- User preferences and quiet hours.\n\n27. Flight Booking System\n- Search cache, seat inventory locking, and eventual consistency.\n- Split payment and ticket issuance flows.\n\n28. Stock Exchange simplified\n- Matching engine, low latency, and ordering guarantees.\n- Market data dissemination and backpressure.\n\n29. E commerce Store Amazon\n- Catalog, cart, checkout, search, and recommendations.\n- Fraud detection and order lifecycle events.\n\n30. Amazon Style Sales Ranking by Category\n- Maintain rolling rankings per category with decay; design counters with sharding and anti skew.\n- Serve fast via precomputed leaderboards and caches; update via streams or batch windows.\n\n31. Distributed Message Queue Kafka\n- Partitions, replication factor, consumer groups, and offsets.\n- Effectively once guarantees via outbox and idempotent consumers.\n\n32. Scale to Millions of Users on AWS\n- Stateless services behind ALB with ASG; Aurora/RDS read replicas, ElastiCache, S3+CloudFront, multi AZ.\n- Apply observability, autoscaling policies, DR, and cost controls; plan limits and regional expansion.\n\n---\n\n## Hard Level 33 to 45\n\n33. Uber\n- Dispatch, ETA estimation, surge pricing, and geo indexing.\n- Driver state machine and mobile connectivity constraints.\n\n34. Zoom\n- Media servers, NAT traversal, and SFU versus MCU tradeoffs.\n- Quality of service and bandwidth adaptation.\n\n35. Google Docs\n- Collaborative editing via OT or CRDT with conflict resolution.\n- Presence, comments, and version history.\n\n36. Google Maps\n- Tile generation, routing engine, and traffic ingestion.\n- Multi level caches from client to edge to origin.\n\n37. Distributed Web Crawler\n- Crawl frontier, deduplication, politeness, and robots rules.\n- Storage tiers for raw pages and indexes.\n\n38. Code Deployment System\n- Blue green and canary releases with fast rollback.\n- Artifact storage, SBOM, and auditability.\n\n39. Distributed Locking Service\n- Fencing tokens, leases, and split brain avoidance.\n- Fairness and starvation considerations.\n\n40. File Sharing Dropbox\n- Delta sync, conflict handling, encryption at rest and in transit.\n- Storage classes and lifecycle policies.\n\n41. Food Delivery DoorDash\n- Order batching, routing, courier location, and SLA.\n- Cold chain requirements and busy hour spikes.\n\n42. Location Based Service Yelp\n- Geo queries, ranking, freshness, and caching.\n- Review moderation and fraud controls.\n\n43. Distributed Cloud Storage S3\n- Durability targets, replication, and erasure coding.\n- Eventual consistency and strong read after write for new objects.\n\n44. Ticket Booking BookMyShow\n- Seat locking, overbooking prevention, and payment races.\n- Queues for on sale events and fairness.\n\n45. Distributed Analytics Data Lake\n- Batch and stream processing with schema evolution.\n- Cost controls for storage and compute with partition pruning.\n\n---\n\nStudy Checklist\nMake four things for every problem\n1 API surface and idempotency notes\n2 Data model with partition keys\n3 High level diagram of components\n4 Scaling and failure plan including DLQ and backpressure\n\nSix Week Plan\nWeek 1 Easy 1 to 10\nWeek 2 Medium 11 to 18\nWeek 3 Medium 19 to 26\nWeek 4 Medium or Hard 27 to 34\nWeek 5 Hard 35 to 40\nWeek 6 Hard 41 to 45\n\nPractice Prompts\nWhat fails first at 10x traffic\nWhat must be strongly consistent versus eventually consistent\nWhere do you cache and how do you invalidate it\nWhat is your retry and idempotency strategy\nWhat is your partition key and why\nWhat is the smallest MVP\n\nIf you want structured, project based guidance, contact me.\n I’ll help you move from theory to production.\n"
}
